[
  {
    "title": "(2010) - WORI | The Idea - The Inception",
    "content": "Women Rights Initiative (WORI) is born from a growing awareness of gender inequality and the need for a dedicated platform to advocate for women's rights children with disability, vulnerable, sickle cell patients, sexual Reproductive awareness. Community leaders, activists, and concerned citizens begin discussions on creating an organization focused on women's empowerment and advocacy."
  },
  {
    "title": "(2011 - 2018) | The Founding Process",
    "content": "WORI's early development involved a collaborative process where like-minded individuals refined the organization's vision and mission, formed a diverse core team, engaged in strategic planning, and initiated funding efforts through outreach to local businesses, philanthropic organizations, and community members."
  },
  {
    "title": "(2019) | Incorporation - A Major Milestone",
    "content": "WORI marked a significant milestone with its official incorporation as a non-profit organization. This achievement recognized WORI's legitimacy and credibility, paving the way for expanded reach, deeper impact, and advancement of its mission to empower women and promote social justice."
  },
  {
    "title": "(2020) | Establishment of Programs - Addressing Critical Needs",
    "content": "WORI developed its initial programs and initiatives, targeting pressing issues such as girl child education, Sexual Reproductive Health Rights (SRHR), sickle cell advocacy, and Gender-Based Violence (GBV). Additionally, the organization provided trainings and support services for women and children in the community, aiming to promote holistic well-being, empowerment, and social change."
  },
  {
    "title": "(2021) | Partnership Development - Expanding Reach and Impact",
    "content": "WORI initiated partnership development efforts, collaborating with like-minded organizations, NGOs, and government agencies to amplify its impact and advance its mission. These strategic partnerships enabled WORI to leverage resources, expertise, and networks, ultimately enhancing its ability to empower women and marginalized communities."
  },
  {
    "title": "(2022 - 2023) | Empowering Women through Skills Acquisition",
    "content": "WORI successfully trained over 1000 women in valuable skills acquisition programs across various communities, including Gulumbe, Dabai, Nayalwa, Birnin Kebbi, and others. This initiative aimed to equip women with the knowledge and skills necessary to achieve economic independence, self-sufficiency, and improved livelihoods."
  }
]